suspicious_ip_activity_last_hours: |
  SigninLogs
  | where TimeGenerated >= ago({hours}h)
  | where IPAddress in ({ips})
  | summarize Count = count() by IPAddress, UserPrincipalName, bin(TimeGenerated, 1h)
  | order by Count desc

rare_external_destinations_last_hours: |
  DeviceNetworkEvents
  | where TimeGenerated >= ago({hours}h)
  | summarize Count = count() by RemoteUrl
  | order by Count asc
  | take 50

blocked_firewall_connections: |
  DeviceNetworkEvents
  | where ActionType == "ConnectionBlocked"
  | where TimeGenerated >= ago({hours}h)
  | summarize BlockedConnections = count() by InitiatingProcessFileName, RemoteIP, bin(TimeGenerated, 1h)
  | order by BlockedConnections desc
